<!-- dflook/terraform-github-actions {"workspace":"ephemeral-2","backend_type":"remote","backend":"3b9366e24d25ca8d7227b29cad34c7ffb0c44d5b5c31c6d2a8d5e75a5b1d5d8d","plan_job_ref":"Job Test Terraform cloud #277 at https://github.com/dflook/terraform-github-actions/actions/runs/12751825799","plan_hash":"d2de1904c8ee724e7c5051a596eef93009db7ed151dd9b3789e9949103075c53","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __ephemeral-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #277](https://github.com/dflook/terraform-github-actions/actions/runs/12751825799)